In [1]:
""" 10.1 GroupBy Mechanics"""

' 10.1 GroupBy Mechanics'

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame({'key1' : ['a','a','b','b','a'],
                   'key2' : ['one','two','one','two','one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

In [5]:
df

      data1     data2 key1 key2
0  1.129945  0.271272    a  one
1 -0.520607 -0.644908    a  two
2  0.462865  0.782442    b  one
3 -0.156850 -2.234683    b  two
4 -1.012509  0.047518    a  one

In [6]:
#calculer la moyenne de data1 à travers key1 (.groupby())
grouped = df['data1'].groupby(df['key1'])

grouped

In [7]:
grouped

In [8]:
grouped.mean()

key1
a   -0.134390
b    0.153008
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [10]:
means

key1  key2
a     one     0.058718
      two    -0.520607
b     one     0.462865
      two    -0.156850
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a     0.058718 -0.520607
b     0.462865 -0.156850

In [12]:
#Créer des GroupBy avec des arrays
states = np.array(['Ohio','California','California','Ohio','Ohio'])

In [13]:
years = np.array([2005,2005,2006,2005,2006])

In [14]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.520607
            2006    0.462865
Ohio        2005    0.486548
            2006   -1.012509
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.134390 -0.108706
b     0.153008 -0.726121

In [16]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.058718  0.159395
     two  -0.520607 -0.644908
b    one   0.462865  0.782442
     two  -0.156850 -2.234683

In [17]:
#retourne une Series contenant les tailles du groupe
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [18]:
""" Iterating over groups """

' Iterating over groups '

In [19]:
#iteration sur une clé
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  1.129945  0.271272    a  one
1 -0.520607 -0.644908    a  two
4 -1.012509  0.047518    a  one
b
      data1     data2 key1 key2
2  0.462865  0.782442    b  one
3 -0.156850 -2.234683    b  two

In [20]:
#itération sur clé double
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
      data1     data2 key1 key2
0  1.129945  0.271272    a  one
4 -1.012509  0.047518    a  one
('a', 'two')
      data1     data2 key1 key2
1 -0.520607 -0.644908    a  two
('b', 'one')
      data1     data2 key1 key2
2  0.462865  0.782442    b  one
('b', 'two')
     data1     data2 key1 key2
3 -0.15685 -2.234683    b  two

In [21]:
#par défaut, groupby groupe sur l'axe 0, mais on peut modifier 
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [22]:
grouped = df.groupby(df.dtypes,axis=1)

In [23]:
grouped

In [24]:
for dtype, group in grouped :
    print(dtype)
    print(group)

float64
      data1     data2
0  1.129945  0.271272
1 -0.520607 -0.644908
2  0.462865  0.782442
3 -0.156850 -2.234683
4 -1.012509  0.047518
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [25]:
""" Selectionner une colonne ou un subset de colonnes"""

' Selectionner une colonne ou un subset de colonnes'

In [26]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [27]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.159395
     two  -0.644908
b    one   0.782442
     two  -2.234683

In [28]:
""" Grouping with Dicts and Series"""

' Grouping with Dicts and Series'

In [29]:
people = pd.DataFrame(np.random.randn(5,5), columns=['a','b','c','d','e'], index=['Joe','Steve','Wes','Jim','Travis'])

In [30]:
people.iloc[2:3,[1,2]] = np.nan

In [31]:
people

               a         b         c         d         e
Joe     1.745253 -0.510443  0.861057 -2.040193 -1.050264
Steve  -0.604956  1.593272  0.237592  0.703619  0.219374
Wes     1.576639       NaN       NaN -0.246251 -0.771851
Jim     0.576822  0.168673 -0.944252  0.742756 -1.706552
Travis  1.110858  0.325891  0.150726 -0.529194  1.155752

In [32]:
#creer un dict de mapping et le faire correspondre aux colonnes (lettres)

In [33]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [34]:
by_column = people.groupby(mapping,axis=1)

In [35]:
by_column.sum()

            blue       red
Joe    -1.179136  0.184545
Steve   0.941211  1.207690
Wes    -0.246251  0.804787
Jim    -0.201496 -0.961057
Travis -0.378468  2.592501

In [36]:
#peut etre utiliser sur les Series
map_series = pd.Series(mapping)

In [37]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [38]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [39]:
""" Grouping witH fUNcTIONS"""

' Grouping witH fUNcTIONS'

In [40]:
people.groupby(len).sum()

          a         b         c         d         e
3  3.898713 -0.341771 -0.083195 -1.543688 -3.528667
5 -0.604956  1.593272  0.237592  0.703619  0.219374
6  1.110858  0.325891  0.150726 -0.529194  1.155752

In [41]:
key_list = ['one','one','one','two','two']
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one  1.576639 -0.510443  0.861057 -2.040193 -1.050264
  two  0.576822  0.168673 -0.944252  0.742756 -1.706552
5 one -0.604956  1.593272  0.237592  0.703619  0.219374
6 two  1.110858  0.325891  0.150726 -0.529194  1.155752

In [42]:
""" Grouping by Index Levels"""

' Grouping by Index Levels'

In [43]:
# TROP PUTAIN DE CHIANT Page 297

In [44]:
""" 10.2 Data Aggregation"""

' 10.2 Data Aggregation'

In [45]:
df

      data1     data2 key1 key2
0  1.129945  0.271272    a  one
1 -0.520607 -0.644908    a  two
2  0.462865  0.782442    b  one
3 -0.156850 -2.234683    b  two
4 -1.012509  0.047518    a  one

In [46]:
#methode .agg()

In [47]:
grouped = df.groupby('key1')

In [48]:
grouped['data1'].quantile(0.9)

key1
a    0.799835
b    0.400894
Name: data1, dtype: float64

In [49]:
#agg() avec une fonction
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [50]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.142454  0.916179
b     0.619715  3.017126

In [51]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.134390  1.122230 -1.012509 -0.766558 -0.520607  0.304669
b      2.0  0.153008  0.438205 -0.156850 -0.001921  0.153008  0.307937

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.129945   3.0 -0.108706  0.477651 -0.644908 -0.298695  0.047518
b     0.462865   2.0 -0.726121  2.133430 -2.234683 -1.480402 -0.726121


           75%       max
key1
a     0.159395  0.271272
b     0.028161  0.782442

In [52]:
""" ColumnWise and Multiple Function Application"""

' ColumnWise and Multiple Function Application'

In [53]:
tips = pd.read_csv('Wesm/tips.csv',sep=',')

In [54]:
tips.columns = ['total_bill','tip','smoker','day','time','size']

In [55]:
tips.head()

   total_bill   tip smoker  day    time  size
0       10.34  1.66     No  Sun  Dinner     3
1       21.01  3.50     No  Sun  Dinner     3
2       23.68  3.31     No  Sun  Dinner     2
3       24.59  3.61     No  Sun  Dinner     4
4       25.29  4.71     No  Sun  Dinner     4

In [56]:
#ajouter une colonne 'tip_pct'
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [57]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       10.34  1.66     No  Sun  Dinner     3  0.160542
1       21.01  3.50     No  Sun  Dinner     3  0.166587
2       23.68  3.31     No  Sun  Dinner     2  0.139780
3       24.59  3.61     No  Sun  Dinner     4  0.146808
4       25.29  4.71     No  Sun  Dinner     4  0.186240

In [58]:
grouped = tips.groupby(['day','smoker'])

In [59]:
grouped_pct = grouped['tip_pct']

In [60]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.161911
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [61]:
#on met en paratmetre une liste de fonctions, on retourne avec un Dataframe
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.161911  0.040477      0.180869
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [62]:
# mettre nos propres noms custom aux aggregats affichés dans le dataframe
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.161911  0.040477
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [63]:
#faire passer les agragats par un array
functions = ['count','mean','max']

In [64]:
result = grouped['tip_pct','total_bill'].agg(functions)

In [65]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          56  0.161911  0.252672         56  20.569464  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [66]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         56  0.161911  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [67]:
#des aggregats differents pas colonne
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   165
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [68]:
grouped.agg({'tip_pct' : ['min','max','mean','std'], 'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.071804  0.252672  0.161911  0.040477  165
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [69]:
""" Retourner les données Aggregats sans les index (rows)"""

' Retourner les données Aggregats sans les index (rows)'

In [70]:
tips.groupby(['day','smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.569464  3.206429  2.946429  0.161911
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863